
# def keyword - არის ფუნქციის გასაღები სიტყვა რომელიც აუცილებელია ფუნქციის შესაქმნელად
# ფუნქციას ვქმნით ჩვენ პროგრამისტები და ჩვენ სურვილისამებრ ვარქმევთ მას სახელს 

name = input("enter your name: ")

def hello(to = "world"): # to - არის პარამეტრი  to = "world" თუ ჩვენი მომხმარებელი დააბრუნებს ცარიელ input-ს მაგ შემთხვევაში პარამეტრის მნიშვნელობა გახდება world რასაც ქვია ნაგულისხმევი მნიშვნელობა
    print(f"Hello {to}")

# ფუნქციის გამოსაძახებლად ჩვენ ფუნქციის გარეთ ვწერთ ფუნქციის სახელს
hello(name) # ჩვენ ფუნქციას გადავეცით არგუმენტრი ცვლადის მნიშვნელობა რაც გადაკოპირდა პარამეტრ to-ში 
