# sep / separator - არის დასახელებული არგუმენტი რომლის გამოყენებაც შეგვიძლია print ფუნქციაში. მისი საშუალებით ჩვენ შეგვიძლია print ფუნქციაში ყოველი არგუმენტის შემდგომ დავწეროთ ნებისმიერი სიმბოლო , სფეისები , ტექსტი ან ნებისმიერი რამ რასაც ჩავწერთ sep=""  არგუმენტში.


# ვეკითხებით მომხმარებელს სახელს 
name = input("enter your name: ")

# ვეკითხებით მომხმარებელს გვარს
surname = input("enter your surname: ")

# end - არის დასახელებული არგუმენტი რომლის გამოყენებაც შეგვიძლია print ფუნქციაში. თუ ჩვენ print ფუნქციაში ჩავწერთ end = "" ჩვენი კურსორი პროგრამის დასრულების შემდეგ აღარ გადავა ახალ ხაზზე და საშუალებას მოგცემს წერა გავნაგრძოთ იმ ხაზიდან სადაც ბოლოს დასრულდა პროგრამა. თუ ჩავწერთ print ფუნქციაში end="/n" ეს უკვე კურსოს ახალ ხაზზე გადაიტანს და არ დატოვებს იმ ხაზშივე კურსორს. ხოლო თუ end="" არგუმენტში თუ ჩავწერთ რაიმე ტექსტს, რიცხვს, სიმბოლოს ან რაიმეს რაც ჩვენ გვსურს ის ჩვენ ჩაწერილს print ფუნქციაში ბოლოს დაამატებს/მიუმატებს იმას რასაც end="" არგუმენტში ჩავწერთ.


# ვესალმებით მომხმარებელს
print("hello", name , surname, "how are you doing", sep="," , end="?")


# ფსევდოკოდი პითონში არის კოდის დაწერამდე დასათაურებული კოდის შინაარსი ანუ კოდის პირობა/დავალების პირობა რომელიც იწერება კომენტარის სახით






