# შედარების ოპერატორები პითონში გვაქვს 6 სახის ესენია: > - მეტობა , < - ნაკლებობა , >= - მეტია ან ტოლია , <= - ნაკლებია ან ტოლია , == - უდრის (მაგ 5 უდრის 5 - ს? 5 == 5 ? პასუხი იქნება ჭეშმარიტი რადგან 5 უდრის 5 - ს. 5 უდრის 6 - ს? 5 == 6 ? პასუხი იქნება მცდარი რადგან 5 არ უდრის 6 - ს) , != - არ უდრის (მაგ 5 არუდრის ხუთს? 5 != 5? პასუხი იქნება მცდარი რადგან 5 ნამდვილად უდრის 5 -ს. 5 არუდრის 6 - ს? 5 != 6 ? პასუხი იქნება ჭეშმარიტი რადგან 5 არუდრის 6 - ს).

# პითონში შედარების ოპერატორები გვჭირდება იმისათვის რომ შევადაროთ ორი მნიშვნელობა ერთმანეთს და მივიღოთ ლოგიკური შედეგი — ანუ True (ჭეშმარიტი) ან False (მცდარი). 


number1 = 5
number2 = 6


print(number1 > number2) # შედეგი იქნება False რადგან 5 არარის მეტი 6 - ზე
print(number1 < number2) # შედეგი იქნება True რადგან 5 არის 6 - ზე ნაკლები
print(number1 >= number2) # შედეგი იქნება False რადგან 5 არც მეტია 6 - ზე და არც 6 - ის ტოლია 5
print(number1 <= number2) # შედეგი იქნება True რადგან 5 არის 6 ზე ნაკლები მაგრამ არარის 6 ის ტოლი. ამშემთხვევაში შედეგში მაინც იქნება True რადგან ერთ ერთი შესრულდა ნაკლებობიდან ან ტოლობიდან
print(number1 == number2) # შედეგი იქნება False რადგან 5 არ უდრის 6 -ს 
print(number1 != number2) # შედეგი იქნება True რადგან 5 ნამდვილად არ არის 6 - ის ტოლი



# if - if ინგლისურად ნიშნავს (თუ) - ს და პითონში გამოიყენება პირობის შესამოწმებლად რომელიც თუ ჭეშმარიტია if ბლოკი მას შეასრულებს ანუ შედეგი გვექნება მაგრამ თუ if პირობა მცდარია ამ if ბლოკს გამოტოვებს ანუ აღარ შეეხება მას.


number = int(input("enter your number: "))


# ჩვენ შევქმენით if ბლოკი სადაც ვამოწმებთ არის თუ არა მომხმარებლის მიერ შემოტანილი რიცხვი 10-ზე მეტი
if number > 10: 
    print("sheni ricxvi metia 10 - ze") 


# თუ შედეგი იქნება ჭეშმარიტი ანუ მომხმარებლის მიერ შემოტანილი რიცხვი თუ იქნება 10 - ზე მეტი ჩვენი if ბლოკი წარმატებით შესრულდება მაგრამ თუ მომხმარებლის რიცხვი არარის 10 - ზე მეტი მაშინ პითონი ამ if ბლოკს გამოტოვებს და აღარ შეეხება მას.

if number < 10:
    print("sheni ricxvi naklebia 10 - ze")

# ჩვენ შეგვიძლია ერთი if ბლოკის გარდა დავწეროთ მეორე if ბლოკი რომლის პირობაც იქნება რომ თუ მომხმარებლის მიერ შემოტანილი რიცხვი ნაკლებია ათზე გამოგვიტანოს შედეგი და არ დავრჩეთ პასუხ გაუცემელი.


if number == 10:
    print("sheni ricxvi 10 - is tolia")

# ჩვენ შეგვიძლია რამდენი if ბლოკიც გვინდა იმდენი დავწეროთ რადგან მომხმარებელი არ დავტოვოთ პასუხ გაუცემელი. თუ მომხმარებლის მიერ შეყვანილი რიცხვი იქნება 10 მომხმარებლის რიცხვი და ჩვენი რიცხვი იქნება ერთმანეთის ტოლი და პითონი არ შეეხება აქამდე დაწერილ ჩვენ ორ if ბლოკს რადგან არცერთის პირობა არ იქნებოდა ჭეშმარიტი. 


