# f-string საშუალებას გვაძლევს რომ ბრჭყალებში ჩავწეროთ და მოვახდინოთ გაერთიანება ჩვენი ცვლადების და ჩვენი სასურველი ტექსტის გაერთიანება.
# ჩვენს მიერ დაწერილი პროგრამა მომხმარებელმა შეიძლება არ გამოიყენოს იმ დანიშნულებით რა დანიშნულებითაც ჩვენ პროგრამა შევქმენით ამ ყველაფრის გამოსასწორებლად გვაქვს ჩვენ strip() ფუნქცია რომელიც ჩვენს კოდს ხდის უფრო დახვეწილს.
# capitalize() - ეს ფუნქცია გვეხმარება რომ მომხმარებლის შეყვანილი ინფორმაციაში და პირველი სიტყვის პირველი ასო გაადიდოს.
# ჩვენ თუ მომხმარებელს ვეკითხებით სახელს და გვარს სრულყოფილად ჩვენ აქ არ გამოგვადგება capitalize() ფუნქცია უნდა გამოვიყენოთ title() ფუნქცია რომელიც მომხმარებლის შეყვანილ წინადადებაში ყველა სიტყვას იწყებს დიდი ასოთი.

name = input("enter your name: ").strip().title()#.capitalize()

print(f"Hello, {name}!")

