#int/integer - მთელი რიცხვი. int ფუნქციის გამოყენება ჩვენ შეგვიძლია როდესაც მომხმარებლის შემოტანილი რიცხვი პითონმა ჩათალა str/string - ად ან როდესაც გვინდა რომ რიცხვები რომელიც პითონმა აღიქვა როგორც ტექსტი ანუ str/string გადავაქციოთ ნამდვილ რიცხვებად რის შემდეგადაც შეგვიძლია რიცხვების გამოყენება მათემატიკურ ოპერაციებშიც.

number = int(input("enter your number: "))  #int() ფუნქციით მომხმარებლის შემოტანილი რიცხვები რომელიც პითონმა აღიქვა როგორც ტექსტი იგი გადავაქციეთ ნამდვილ რიცხვად

print(number + 10)  # მოვახდინეთ მათმატიკური ოპერაცია (მიმატება)


#float - არის წერტილოვანი რიცხვი ანუ ათწილადი. float ფუნქციის გამოყენება ჩვენ შეგვიძლია მაშინ როდესაც მომხმარებელს ვეკითხებით ათწილადი რიცხვის შეყვანას float ფუნქცია მომხმარებლის შემოტანილ რიცხვს რომელიც პითონმა აღიქვა ტექსტის ნაწილად იგი მას გადააქცევს ათწილად რიცხვად. თუ მომხმარებელი ათწილად რიცხვს არ შეიყვანს და შეიყვანს უბრალოდ მთელ რიცხვს float მაინც აღიქვამს მას რიცხვად მაგრამ როგორც ათწილადად და მოახდენს მასზე მათემატიკურ ოპერაციებს რომელიც შედეგში გამოიტანს ათწილადის სახით.

number1 = float(input("enter your number: "))  # float() ფუნქციით მომხმარებლის შემოტანილი რიცხვები რომელიც პითონმა აღიქვა როგორც ტექსტი იგი გადავაქციეთ ათწილად რიცხვად.


print(number1 - 3)  # მოვახდინეთ მათმატიკური ოპერაცია (გამოკლება)



#round - ფუნქციით ჩვენ შეგვიძლია ათწილადის დამრგვალება მთელ რიცხვამდე. ანუ თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 5.5 round ფუნქცია მას დაამრგვალებს 6 ამდე და შედეგში გამოგვიტანს 6 -ს. ხოლო თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 5.4 round ფუნქცია მას დაამრგვალებს 5 - ამდე და შედეგში გვექნება 5 

number2 = float(input("enter your number: "))

number3 = round(number2)

print(number3)



# რიცხვის ფორმატირება პითონში ნიშნავს რომ რიცხვს ვცვლით ლამაზ/წასაკითხ ფორმად.

number4 = int(input("enter your number: "))

print(f"{number4:,}") # ამით ჩვენ ვეუბნებით პითონს რომ ყოველ ათასებში მძიმე (,) ჩასვას მაგ: 1,000 ან 1,000,500


number5 = float(input("enter your number: "))

print(f"{number5:,.2f}") # ამით ჩვენ პითონს ვუთხარით რომ მომხმარებლის მიერ შემოყვანილი ათწილადის წერტილის შემდეგ გამოგვიტანოს 2 ციფრი. მაგ: 12.8769908 - 12.87






