# function - ფუნქცია არის შენი ან სხვა პროგრამისტის მიერ დაწერილი პროგრამა რომლის გამოყენებაც შეგვიძლია თუ ამ ფუნქციის სახელი ვიცით.

# variable = value
# = - არის მიმნიჭებელი პარამეტრი რომელიც ცვლადის სახელს ანიჭებს თავის მნიშვნელობას.
# ცვლადი - არის პროგრამირებაში კონტეინერი რომელიც შედგება სამი კომპონენტისგან ესენია : ცვლადის სახლი , მიმნიჭებელი ფუნქცია = , ცვლადის მნიშვნელობა.
# input - ნიშნავს შეტანა/შეყვანას რომელიც საშუალებას აძლევს მომხმარებელს რომ შეიყვანოს სასურველი ინფორმაცია terminal - ში.
name = input("enter your name: ")
# python - ში გვაქვს ჩვენ print() ფუნქცია რომელიც საშუალებას გვაძლევს გამოვიტანოთ რაიმე ინფორმაცია ან უბრალოდ ტექსტი ეკრანზე შედეგის სახით.
# print("Hello, World!")
# კონკადენაცია არის ორი String- ის ერთმანეთთან შეერთება/შეწებება.
# string - არის ტექსტი / სტრიქონი რომელიც იწერება "" - ში.
print("Hello " + name)


#კომენტარები არის დაწერილი პროგრამისტებისთვის რომელიც ჩვენ გვეხმარება კოდის ადვილად გარჩევაში პროგრამა მას არ აღიქვამს ბრძანებად.
